     A          R TESTFR
     A            TSFLD1         6A
     A            TSFLD2        15A
     A            TSFLD3        12A
     A            TSFLD4         3A
